backend-rails/app/controllers/messages_controller.rb

INSERT INTO "messages" ("text", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "hello"], ["created_at", "2019-05-07 17:01:39.559112"], ["updated_at", "2019-05-07 17:01:39.559112"], ["user_id", 4]]
---
  def create
    @message = Message.create(message_params)

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "messages" SET "text" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["text", ""], ["updated_at", "2019-05-07 18:01:15.569314"], ["id", 1]]
---
  def update
    @message = Message.find(params[:id])
    @message.update(text: params["_json"])

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 4]]
---
  def destroy
    @message = Message.find(params[:id])
    @message.destroy