backend-rails/app/controllers/saved_drawings_controller.rb

SELECT "saved_drawings".* FROM "saved_drawings"
---
  def index
    @drawings = SavedDrawing.all

INSERT INTO "saved_drawings" ("paths_text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
---
  def create
    encodedString = ActiveSupport::JSON.encode(params)
    @drawing = SavedDrawing.new(paths_text: encodedString)
    if @drawing.save